tests/stripe-messages/subscription-cancelled.json

{
    "id": "evt_subscriptioncanceled",
    "type": "customer.subscription.deleted",
    "data": {
        "object": {
            "id": "sub_1KQYMRLEJyfuWvBB831StfM3",
            "object": "subscription",
            "application_fee_percent": null,
            "automatic_tax": {
                "enabled": false
            },
            "billing_cycle_anchor": 1644244714,
            "billing_thresholds": null,
            "cancel_at": null,
            "cancel_at_period_end": false,
            "canceled_at": 1645705273,
            "collection_method": "charge_automatically",
            "created": 1644244714,
            "current_period_end": 1646663914,
            "current_period_start": 1644244714,
            "customer": "cus_L6luBWhKH2k2aL",
            "days_until_due": null,
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [],
            "discount": null,
            "ended_at": 1645705273,
            "items": {
                "object": "list",
                "data": [
                    {
                        "id": "si_L6lubizVeLo9f8",
                        "object": "subscription_item",
                        "billing_thresholds": null,
                        "created": 1644244715,
                        "metadata": {},
                        "plan": {
                            "id": "price_1KQYMQLEJyfuWvBBOaxgDqi1",
                            "object": "plan",
                            "active": false,
                            "aggregate_usage": null,
                            "amount": 500,
                            "amount_decimal": "500",
                            "billing_scheme": "per_unit",
                            "created": 1644244714,
                            "currency": "eur",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_JjiIPD7pifRJMk",
                            "tiers": null,
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "price_1KQYMQLEJyfuWvBBOaxgDqi1",
                            "object": "price",
                            "active": false,
                            "billing_scheme": "per_unit",
                            "created": 1644244714,
                            "currency": "eur",
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_JjiIPD7pifRJMk",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tax_behavior": "unspecified",
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 500,
                            "unit_amount_decimal": "500"
                        },
                        "quantity": 1,
                        "subscription": "sub_1KQYMRLEJyfuWvBB831StfM3",
                        "tax_rates": []
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/subscription_items?subscription=sub_1KQYMRLEJyfuWvBB831StfM3"
            },
            "latest_invoice": "in_1KQYMRLEJyfuWvBBiZkrdZ0T",
            "livemode": false,
            "metadata": {},
            "next_pending_invoice_item_invoice": null,
            "pause_collection": null,
            "payment_settings": {
                "payment_method_options": null,
                "payment_method_types": null
            },
            "pending_invoice_item_interval": null,
            "pending_setup_intent": null,
            "pending_update": null,
            "plan": {
                "id": "price_1KQYMQLEJyfuWvBBOaxgDqi1",
                "object": "plan",
                "active": false,
                "aggregate_usage": null,
                "amount": 500,
                "amount_decimal": "500",
                "billing_scheme": "per_unit",
                "created": 1644244714,
                "currency": "eur",
                "interval": "month",
                "interval_count": 1,
                "livemode": false,
                "metadata": {},
                "nickname": null,
                "product": "prod_JjiIPD7pifRJMk",
                "tiers": null,
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
            },
            "quantity": 1,
            "schedule": null,
            "start_date": 1644244714,
            "status": "canceled",
            "tax_percent": null,
            "transfer_data": null,
            "trial_end": null,
            "trial_start": null
        }
    }
}