tests/stripe-messages/subscription-updated.json

{
    "id": "evt_1KfOwMLEJyfuWvBBeJTpXsT4",
    "object": "event",
    "api_version": "2020-03-02",
    "created": 1647783422,
    "data": {
        "object": {
            "id": "sub_1KdBjXLEJyfuWvBBStR9MJFk",
            "object": "subscription",
            "application_fee_percent": null,
            "automatic_tax": {
                "enabled": false
            },
            "billing_cycle_anchor": 1647608112,
            "billing_thresholds": null,
            "cancel_at": null,
            "cancel_at_period_end": false,
            "canceled_at": null,
            "collection_method": "charge_automatically",
            "created": 1647608060,
            "current_period_end": 1650286512,
            "current_period_start": 1647608112,
            "customer": "cus_LLM1Z6ETkStTib",
            "days_until_due": null,
            "default_payment_method": "pm_1KefJyLEJyfuWvBBBsM8xcDM",
            "default_source": null,
            "default_tax_rates": [],
            "discount": null,
            "ended_at": null,
            "items": {
                "object": "list",
                "data": [
                    {
                        "id": "si_LM7AcQ509bV1pC",
                        "object": "subscription_item",
                        "billing_thresholds": null,
                        "created": 1647783422,
                        "metadata": {},
                        "plan": {
                            "id": "price_1J6ErRLEJyfuWvBBEnN3Y6La",
                            "object": "plan",
                            "active": true,
                            "aggregate_usage": null,
                            "amount": 100,
                            "amount_decimal": "100",
                            "billing_scheme": "per_unit",
                            "created": 1624626861,
                            "currency": "eur",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_JjiIPD7pifRJMk",
                            "tiers": null,
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "price_1J6ErRLEJyfuWvBBEnN3Y6La",
                            "object": "price",
                            "active": true,
                            "billing_scheme": "per_unit",
                            "created": 1624626861,
                            "currency": "eur",
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_JjiIPD7pifRJMk",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tax_behavior": "unspecified",
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 100,
                            "unit_amount_decimal": "100"
                        },
                        "quantity": 5,
                        "subscription": "sub_1KdBjXLEJyfuWvBBStR9MJFk",
                        "tax_rates": []
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/subscription_items?subscription=sub_1KdBjXLEJyfuWvBBStR9MJFk"
            },
            "latest_invoice": "in_1KefKnLEJyfuWvBBbTfYKt4u",
            "livemode": false,
            "metadata": {
                "amount": "4",
                "campaign": "42",
                "country": "SI",
                "email": "aaronelliotross+mevuvamyl@gmail.com",
                "firstname": "Violet",
                "frequency": "monthly",
                "initialAmount": "8",
                "language": "en",
                "lastname": "Pierce",
                "paymentMethod": "stripe",
                "postcode": "11111",
                "speakoutCampaign": "42"
            },
            "next_pending_invoice_item_invoice": null,
            "pause_collection": null,
            "payment_settings": {
                "payment_method_options": null,
                "payment_method_types": null
            },
            "pending_invoice_item_interval": null,
            "pending_setup_intent": null,
            "pending_update": null,
            "plan": {
                "id": "price_1J6ErRLEJyfuWvBBEnN3Y6La",
                "object": "plan",
                "active": true,
                "aggregate_usage": null,
                "amount": 100,
                "amount_decimal": "100",
                "billing_scheme": "per_unit",
                "created": 1624626861,
                "currency": "eur",
                "interval": "month",
                "interval_count": 1,
                "livemode": false,
                "metadata": {},
                "nickname": null,
                "product": "prod_JjiIPD7pifRJMk",
                "tiers": null,
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
            },
            "quantity": 5,
            "schedule": null,
            "start_date": 1647608060,
            "status": "active",
            "tax_percent": null,
            "test_clock": null,
            "transfer_data": null,
            "trial_end": null,
            "trial_start": null
        },
        "previous_attributes": {
            "items": {
                "data": [
                    {
                        "id": "si_LLM28GJKT872lQ",
                        "object": "subscription_item",
                        "billing_thresholds": null,
                        "created": 1647608060,
                        "metadata": {},
                        "plan": {
                            "id": "price_1KefJwLEJyfuWvBBd4ng2yOi",
                            "object": "plan",
                            "active": false,
                            "aggregate_usage": null,
                            "amount": 400,
                            "amount_decimal": "400",
                            "billing_scheme": "per_unit",
                            "created": 1647608060,
                            "currency": "eur",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_JjiIPD7pifRJMk",
                            "tiers": null,
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "price_1KefJwLEJyfuWvBBd4ng2yOi",
                            "object": "price",
                            "active": false,
                            "billing_scheme": "per_unit",
                            "created": 1647608060,
                            "currency": "eur",
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_JjiIPD7pifRJMk",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tax_behavior": "unspecified",
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 400,
                            "unit_amount_decimal": "400"
                        },
                        "quantity": 1,
                        "subscription": "sub_1KdBjXLEJyfuWvBBStR9MJFk",
                        "tax_rates": []
                    }
                ]
            },
            "plan": {
                "id": "price_1KefJwLEJyfuWvBBd4ng2yOi",
                "active": false,
                "amount": 400,
                "amount_decimal": "400",
                "created": 1647608060
            },
            "quantity": 1
        }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
        "id": "req_Tebp5vRkC4t4Z1",
        "idempotency_key": "195e09b8-ee3f-48a4-b577-2b514f38459a"
    },
    "type": "customer.subscription.updated"
}